---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.ElementTypeDuplicatingEventArgs
source: html/7205a40d-f393-771b-6158-cd7391efbeda.htm
---
# ElementTypeDuplicatingEventArgs Methods

When the event is cancellable, may call the Cancel() method to cancel it.